<template>
	<view class="crew-wrapper">
		<!-- 船员配置 -->
	</view>
</template>

<script>
	const maps = {
		value1: {
			1: '长度≥45米非远洋渔业船舶配备一级船长、一级船副和助理船副各1名',
			2: '36米≤长度<45米船舶配备二级船长、二级船副和助理船副各1名',
			3: '24米<长度<36米船舶配备二级船长和二级船副各1名',
			4: '12米≤长度<24米船舶配备三级船长和助理船副各1名'
		},
		value2: {
			1: '主机总功率≥3000千瓦渔业船舶一级轮机长和一级管轮各1名，助理管轮2名',
			2: '主机总功率≥3000千瓦渔业船舶一级轮机长和一级管轮各1名，助理管轮2名',
			3: '450千瓦≤主机总功率<750千瓦渔业船舶二级轮机长、二级管轮和助理管轮各1名',
			4: '450千瓦≤主机总功率<750千瓦渔业船舶二级轮机长、二级管轮和助理管轮各1名'
		},
		value: {
			1: '普通船员持有普通船员证书'
		}
	}
	export default {
		props: {
			value: Object
		},
		data () {
			return {
				
			}
		},
		methods: {}
	}
</script>

<style lang="scss" scoped>
</style>
